2020-09-08-install-latex-in-windows.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-26 Tue 23:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Install Latex in Windows</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Peter Tillemans">
<link rel="stylesheet" href="css/site.css"
  type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="nav">
<ul>
<li><a href="/">Home</a></li>
<li><a href="https://github.com/ptillemans">GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<header>
<h1 class="title">Install Latex in Windows</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6e05d5d">1. Installation</a>
<ul>
<li><a href="#installing-miktex">1.1. Installing MikTex</a></li>
<li><a href="#installing-the-custom-latex-templates">1.2. Installing the custom LaTeX templates</a></li>
<li><a href="#installing-the-custom-templates">1.3. Installing the custom templates</a></li>
<li><a href="#configuring-miktex">1.4. Configuring MikTex</a></li>
</ul>
</li>
<li><a href="#using-it">2. Using it</a>
<ul>
<li><a href="#creating-a-pdf">2.1. Creating a PDF</a></li>
<li><a href="#fix-errors">2.2. Fix Errors</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
I have some latex templates to format documents to create fancy formal
looking PDF versions of my plaintext mode documents I create in
<i>org-mode</i> in <i>emacs</i>, well <i>spacemacs</i> actually.
</p>

<div id="outline-container-org6e05d5d" class="outline-2">
<h2 id="org6e05d5d"><span class="section-number-2">1</span> Installation</h2>
<div class="outline-text-2" id="text-1">
<p>
Since this are tools built in the UNIX world I expected a protracted
battle before I got all settings right, especially since there was no
version of Live Tex in the chocolatey repositories. I never tried MikTex
before.
</p>
</div>

<div id="outline-container-org31a7d62" class="outline-3">
<h3 id="installing-miktex"><a id="org31a7d62"></a><span class="section-number-3">1.1</span> Installing MikTex</h3>
<div class="outline-text-3" id="text-installing-miktex">
<p>
That is easy, in an admin shell run :
</p>

<pre class="example">
&gt; choco install miktex
</pre>

<p>
This will take a bit so we can already fetch the templates.
</p>
</div>
</div>

<div id="outline-container-org6c1bb7d" class="outline-3">
<h3 id="installing-the-custom-latex-templates"><a id="org6c1bb7d"></a><span class="section-number-3">1.2</span> Installing the custom LaTeX templates</h3>
<div class="outline-text-3" id="text-installing-the-custom-latex-templates">
<p>
I keep my templates in git repositories for easy updating. Some are
shared with others so new features are sometimes added. Let's make a
place for these
</p>

<p>
In the msys terminal :
</p>

<pre class="example">
$ cd
$ mkdir -p .local/texmf/tex/latex
</pre>

<p>
I want to use the <i>.local/texmf</i> as the local extension folder, but
<i>MikTex</i> will not allow to select it if the <i>tex/latex</i> folders are
missing. Also this is consistent with the Mac and Linux versions.
</p>
</div>
</div>

<div id="outline-container-orga129bae" class="outline-3">
<h3 id="installing-the-custom-templates"><a id="orga129bae"></a><span class="section-number-3">1.3</span> Installing the custom templates</h3>
<div class="outline-text-3" id="text-installing-the-custom-templates">
<p>
Just add the repos for the <i>.sty</i> and <i>.cls</i> files to the folder we just
made:
</p>

<pre class="example">
$ cd ~/.local/texmf/tex/latex
$ git clone git@gitlab.xomeplace.com:latex/xomeplace-latex.git
$ ... repeat for other templates ...
</pre>
</div>
</div>

<div id="outline-container-orge0b32c5" class="outline-3">
<h3 id="configuring-miktex"><a id="orge0b32c5"></a><span class="section-number-3">1.4</span> Configuring MikTex</h3>
<div class="outline-text-3" id="text-configuring-miktex">
<p>
After installation look for MikTex in the <i>Start Menu</i> to start the
config tool. It will complain that no update has been done yes, so I
humoured it by updating, none are available since it is just installed,
but it keeps regularly reminding me to update. I assume this'll go away
once some update arrives.
</p>

<p>
Add the <i>texmf</i> folder we created :
</p>

<ul class="org-ul">
<li>Press the '+' icon</li>
<li>Navigate the ~/.local/texmf</li>
<li>Confirm</li>
</ul>

<p>
Keep the tool open because we need to copy the location of the <i>bin</i>
folder in the next step.
</p>

<p>
## Add the TeX tools to the PATH
</p>

<p>
I only use the TeX tools from Spacemacs so I'll just add it there. The
Spacemacs dev team decided to make the environment variables, including
the path, load from a config file. Having been at the receiving end of
the confusion which follows from the subtle differences when launching
<i>Emacs</i> as daemon, from the GUI menu or from the command line, I
heartily applaud this approach.
</p>

<p>
In any case I just update the PATH in <i>Spacemacs</i>
</p>

<ul class="org-ul">
<li>Space f e e (to open the environment config file)</li>
<li>find the line with PATH= ( <i>'</i>' PATH Enter, maybe some /n* to find the
one)</li>
<li>Copy the location from the config tool</li>
<li>Paste it in the PATH value (do not forget the ';' separator)</li>
<li>Esc : w (to save changes)</li>
<li>Space f e E (to reload the new value)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgba5bed8" class="outline-2">
<h2 id="using-it"><a id="orgba5bed8"></a><span class="section-number-2">2</span> Using it</h2>
<div class="outline-text-2" id="text-using-it">
<p>
Well nothing new here, it kind of just works:
</p>
</div>

<div id="outline-container-org9293eb4" class="outline-3">
<h3 id="creating-a-pdf"><a id="org9293eb4"></a><span class="section-number-3">2.1</span> Creating a PDF</h3>
<div class="outline-text-3" id="text-creating-a-pdf">
<p>
Open an org file with the <i>LaTeX headers</i> or add them with <i>, e e #</i> and
select latex from the list. Check the <i>LATEX<sub>CLASS</sub></i> is one of the custom
classes.
</p>

<p>
Then <i>, e e l o</i> and &#x2026; nothing will happen, &#x2026;, well emacs tells it
is busy with the texfile. It takes a while, taskmaster shows processes
blinking in and of existence under the Emacs process. I assume MikTex is
compiling stuff in the background of first use.
</p>

<p>
Eventually it returns stating PDF export failed and to consult the log
file.
</p>
</div>
</div>

<div id="outline-container-orgede8e1d" class="outline-3">
<h3 id="fix-errors"><a id="orgede8e1d"></a><span class="section-number-3">2.2</span> Fix Errors</h3>
<div class="outline-text-3" id="text-fix-errors">
<p>
The end of the logfile showed scary things of not being able to write.
Let's ignore those for now : I learned to treat the first errors in the
LaTeX log output first, and retry and move my way down the log till
there are no more errors.
</p>

<p>
First Error : 'Libertine Font' was not found, a bit further the same
with 'Lato'.
</p>

<p>
Download the fonts, unzip, select all <i>.ttf</i> files and right-click
install.
</p>

<p>
Try again and the PDF opens &#x2026; in the Edge Browser ??? And the Edge
Browser attached itself to the taskbar??? Again??? I need to tackle that
some time.
</p>

<p>
Well, it works. Take the document and send it to those you wanted to
impress.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer"> Copyright 2020 Peter Tillemans (<a href="http://validator.w3.org/check?uri=referer">Validate</a>
  HTML).<br> Last updated 2021-01-26 Tue 23:09.<br> Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9).  </div>
</div>
</body>
</html>
